src/cf/Catalogs/уатЭтапыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатЭтапыОплаты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтсчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВариантыОтсчетаДатыПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСопроводительногоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыСопроводительныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНаПлатежномКалендареДоДоставкиГруза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНаПлатежномКалендареДоДоставкиГрузаЧерезДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатВариантыОтсчетаДатыПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВариантыОтсчетаДатыПлатежа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоОтправленияПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеОтправленияПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоПрибытияПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеПрибытияПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеДоставкиГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеОтправкиКомплектаСопроводительныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеПолученияСопроводительныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеДатыДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеДатыОказанияУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеВыполненияРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяДата</Name>
					<Comment>Используется при указании даты платежа в накладных вручную (закладка Дополнительно)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатЭтапыОплаты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Автотест = Истина;
		Возврат;
	КонецЕсли;
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	ВидДней = ?(ЗначениеЗаполнено(Объект.ПроизводственныйКалендарь), 1, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьНаименование(Команда)
	
	ЗаполнитьНаименованиеПоШаблону();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантОтсчетаПриИзменении(Элемент)
	
	Если Объект.ВариантОтсчета <> ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов") Тогда
		Объект.ВидСопроводительногоДокумента = Неопределено;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ВариантОтсчета) ИЛИ Объект.ВариантОтсчета =
		ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПроизвольнаяДата") Тогда
		Объект.Срок = 0;
		Объект.ПроизводственныйКалендарь = Неопределено;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДнейПриИзменении(Элемент)

	Если ВидДней = 0 Тогда
		Объект.ПроизводственныйКалендарь = Неопределено;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНаПлатежномКалендареДоДоставкиГрузаПриИзменении(Элемент)
	
	Если НЕ Объект.ОтображатьНаПлатежномКалендареДоДоставкиГруза Тогда
		Объект.ОтображатьНаПлатежномКалендареДоДоставкиГрузаЧерезДней = 0;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьНаименованиеПоШаблону()

	СтрокаНаименование = "" + Объект.Процент + "%";
	
	Если Объект.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПроизвольнаяДата") Тогда
		СтрокаНаименование = СтрокаНаименование + " на произвольную дату";
	Иначе
		Если Объект.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ДоОтправленияПоЗаказу")
			ИЛИ Объект.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ДоПрибытияПоЗаказу") Тогда
			СтрокаНаименование = СтрокаНаименование + " за";
		ИначеЕсли Объект.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеДоставкиГруза")
			ИЛИ Объект.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеОтправленияПоЗаказу")
			ИЛИ Объект.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов")
			ИЛИ Объект.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеПрибытияПоЗаказу") Тогда
			СтрокаНаименование = СтрокаНаименование + " через";
		КонецЕсли;
	
		СтрокаНаименование = СтрокаНаименование + " " + Объект.Срок;
		СтрокаНаименование = СтрокаНаименование + " " + ?(ВидДней = 0, "календ. дн.", "раб. дн.");
		СтрокаНаименование = СтрокаНаименование + " " +	НРег(Лев(Объект.ВариантОтсчета, 1)) + Сред(Объект.ВариантОтсчета, 2);
	КонецЕсли;
	
	Объект.Наименование = СтрокаНаименование;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаСрок.Видимость = (Объект.ВариантОтсчета
		<> ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПроизвольнаяДата"));
	Элементы.ПроизводственныйКалендарь.Доступность = (ВидДней = 1);
	Элементы.ВидСопроводительногоДокумента.Видимость = (Объект.ВариантОтсчета
		= ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов"));
	Элементы.ОтображатьНаПлатежномКалендареДоДоставкиГрузаЧерезДней.Доступность
		= Объект.ОтображатьНаПлатежномКалендареДоДоставкиГруза;
	Элементы.ДекорацияОтображатьНаПлатежномКалендареДоДоставкиГрузаЧерезДней.Доступность
		= Элементы.ОтображатьНаПлатежномКалендареДоДоставкиГрузаЧерезДней.Доступность;
	Элементы.ГруппаПредварительноеОтображениеНаПК.Видимость = Объект.ВариантОтсчета
		= ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеДоставкиГруза")
		ИЛИ Объект.ВариантОтсчета
		= ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеОтправкиКомплектаСопроводительныхДокументов")
		ИЛИ Объект.ВариантОтсчета
		= ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов");
	
КонецПроцедуры

#КонецОбласти
